# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with P2/4 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0-p2 head
head:
  - [2, 1,  Conv, [256]] # 10
  - [4, 1, Conv, [256]]  # 11
  - [6, 1, Conv, [256]]  # 12
  - [9, 1, Conv, [256]]  # 13

  - [-1, 1,  nn.Upsample, [None, 2, 'nearest']] 
  - [[-1, 12], 1, BiConcat2, [1]] 
  - [-1, 3, C2f, [256]] # 16
 
  - [-1, 1,  nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 11], 1, BiConcat2, [1]] 
  - [-1, 3, C2f, [256]] # 19
  
  - [-1, 1,  nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 10], 1, BiConcat2, [1]]
  - [-1, 3, C2f, [256]] #22 (P2/4-xsmall)
 
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11, 19], 1, BiConcat3, [1]] 
  - [-1, 3, C2f, [256]] # 25 (P3/8-small)
 
  - [-1, 1, Conv, [256, 3, 2]] 
  - [[-1, 12, 16], 1, BiConcat3, [1]] 
  - [-1, 3, C2f, [256]] # 28 (P4/16-medium)
 
  - [-1, 1, Conv, [256, 3, 2]] 
  - [[-1, 13], 1, BiConcat2, [1]] 
  - [-1, 3, C2f, [256]] # 31 (P5/32-large)
 
  - [[22, 25, 28,31], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
